tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "universal-ctags/universal-ctags"
# Fast, simple and clean video downloader
brew "annie"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Command-line interface for SQLite
brew "sqlite"
# Record and share terminal sessions
brew "asciinema"
# Shell extension to jump to frequently used directories
brew "autojump"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# High performance code minimap generator
brew "code-minimap"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Top-like interface for container metrics
brew "ctop"
# Programmatically minimize files to isolate features of interest
brew "delta"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd", args: ["HEAD"]
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Spell checker and morphological analyzer
brew "hunspell"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase", link: true
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# High dynamic-range image file format
brew "openexr", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv", args: ["HEAD"]
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv", args: ["HEAD"]
# GUI for vim, made for macOS
brew "macvim", link: false
# Text-to-HTML conversion tool
brew "markdown"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# File browser
brew "ranger"
# Adjust color temperature of your screen according to your surroundings
brew "redshift"
# Search tool like grep and The Silver Searcher
brew "ripgrep", args: ["HEAD"]
# Rust toolchain installer
brew "rustup-init"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"], link: false
# Syntax-aware linter for prose
brew "vale"
# Vi 'workalike' with many additional features
brew "vim", link: false
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Graphical user interface for Aria2
cask "aria2gui"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher", args: { language: "ist" }
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# E-books management software
cask "calibre", args: { language: "ist" }
# Tool to list all active shortcuts of the current application
cask "cheatsheet", args: { language: "ist" }
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# App to build and share containerized applications and microservices
cask "docker"
cask "fman"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
# Go (golang) IDE
cask "goland"
cask "hyperdock"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
cask "mark-text"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source download manager
cask "motrix"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Git client
cask "smartgit"
# Rime input method engine
cask "squirrel"
cask "switchkey"
# To-do & task list manager
cask "ticktick"
# Third-party NetEase cloud player
cask "yesplaymusic"
mas "CAJ云阅读", id: 1121965993
mas "Cinebench", id: 1438772273
mas "iPreview", id: 1519213509
mas "Keynote 讲演", id: 409183694
mas "Maipo", id: 789066512
mas "Pocket", id: 568494494
mas "Toolbox for Keynote -Templates", id: 582635628
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
mas "微信", id: 836500024
